#include<locale.h>
#include<stdio.h>

void date()
{
	puts("__  __     __  ___    __   __  __  /        ");
	puts(" |  ||     ||  |       |   ||  ||  |__       ");
	puts("/   ||     ||  ___    /    ||  ||  | |       ");
	puts("__  __  *  __    /  * __   __  __  ___        ");
}




void name()
{
	setlocale(LC_ALL, "RUS");
	puts("*******************************************");
	puts("*                                         *");
	puts("* тема: Разработка консольного приложения *");
	puts("* Выполнил: Ульянов Кирилл                *");
	puts("*                                         *");
	puts("*******************************************");
}



void main()
{
	
	name();
	date();
}
