#include<stdio.h>
#include<locale.h>



void main()
{

	/*Точка с координатами (2;3) будет входить в область
	А точка с координатами (2;0) не будет входить в область*/



	setlocale(LC_ALL, "RUS");

	int x, y;
	
	printf("Введите координату x: ");
	scanf_s("%d", &x);

	printf("Введите координату y: ");
	scanf_s("%d", &y);

	if ((y == 1) && (x >= (-6)) && (x <= 7))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 2) && (x >= (-5.5)) && (x <= 6.5))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 3) && (x >= (-5)) && (x <= 6))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 4) && (x >= (-4.5)) && (x <= 5.5))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 5) && (x >= (-4)) && (x <= 5))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 6) && (x >= (-3.5)) && (x <= 4.5))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else if ((y == 7) && (x >= (-3)) && (x <= 4))
	{
		printf("Точка с координатами (%d;%d) входит в заданную область", x, y);
	}
	else
	{
		printf("Точка с координатами (%d;%d) не входит в заданную область", x, y);
	}
}